{
  "fr": {
    "desc": [
      "Inventory est une application mobile qui vise à réaliser des inventaires pour les TPE/PME comme les restaurants, coiffeurs, et autres petits commerces.",
      "Cette application est disponible aussi bien pour iOS que pour Android.",
      "Elle permet à l'utilisateur d'ajouter, modifier ou supprimer des articles avec une quantité, un prix et une catégorie. L'utilisateur peut aussi créer des catégories personnalisées.",
      "L'application peut exporter l'inventaire au format CSV. Les données sont enregistrées dans une base de donnée MongoDB.",
      "Ce projet à été créer en utilisant la CLI de ignite et le boilerplate andross."
    ],
    "features": [
      "Ajouter, Modifier, Supprimer des articles et catégories",
      "Export de l'inventaire en CSV",
      "Base de donnée MongoDB",
      "Design Néomorphique",
      "Thème Sombre/Clair",
      "Disponible pour Android & iOS"
    ],
    "next-steps": [
      "Implementer GraphQL / Apollo Client",
      "Migrer du système de base de donnée Google Cloud Firestore vers MongoDB",
      "Implementer une liste infinie optimisée",
      "Ajouter l'export de l'inventaire en CSV"
    ],
    "enhancements": []
  },
  "en": {
    "desc": [
      "Inventory is an app aiming to realize inventory for little businesses like restaurants, hairdressers, retailing shop and many others.",
      "The app is available on Android as well as on iOS.",
      "It provides articles the user can add, update or delete with a quantity, a price dans a category. The user can also create custom categories.",
      "The application is able to export data to CSV file. Data are stored in a mongoDB database.",
      "This project has been created using ignite CLI with andross boilerplate."
    ],
    "features": [
      "Add, update, delete articles and categories",
      "CSV export",
      "MongoDB database",
      "Neumorphism design",
      "Dark / Light themes",
      "Available for Android & iOS"
    ],
    "next-steps": [
      "Implement GraphQL / Apollo Client",
      "Migrate from cloud firestore database system to mongoDB",
      "Implement optimized infinite list",
      "Add CSV export"
    ],
    "enhancements": []
  },
  "techno": [
    "React-Native",
    "GraphQL",
    "ESLint",
    "Webpack",
    "Babel",
    "Ignite",
    "React-Navigation",
    "Redux",
    "MongoDB",
    "Jest",
    "CSV"
  ]
}
